export const T = {
    input_placeholders: {
        task_title: "Назвіть Ваше завдання",
        task_description: "Опишіть Ваше завдання",
    },
    common: {
        create: "Створити",
        edit: "Редагувати",
        update: "Оновити",
        close: "Закрити",
        delete: "Видалити",
        perform: "Виконувати",
        complete: "Завершити",
    },
    notifications: {
        task: {
            created: "Ви успішно створили нове завдання і воно було додане до списку Ваших завдань!",
            updated: "Ви успішно оновили Ваше завдання і воно було оновлене у списку Ваших завдань!",
            removed: "Ви успішно видалили Ваше завдання і воно було прибране зі списку Ваших завдань!",
            started: "Ви успішно почали виконувати завдання!",
            completed: "Ви успішно завершили виконувати завдання!",
            already_started: "Завдання вже виконується!",
            already_completed: "Завдання вже завершено!",
        },
    },
    descriptions: {
        edit_task: "Тут Ви можете редагувати Ваше завдання!",
        main_page: "Ласкаво просимо до додатку для списку справ - Alex Mobile TODO!",
    },
    titles: {
        tabs: {
            main: "Головна",
            create_task: "Створити завдання",
            task_list: "Список завдань",
        },
        create_task: "Створіть ваше завдання в Alex Mobile TODO!",
        edit_task_dialog: "Редагувати Ваше завдання",
        success: "Ура, успішно!",
        error: "Оййойой, щось пішло не так!",
        redirect_to_create_task: "Перейти до створення нових завдань!",
    },
    identifier: "Ідентифікатор",
    title: "Назва",
    description: "Опис",
    status: "Статус",
    empty_task_list: "На жаль, Ви поки ще не створили жодного завдання в списку!",
};
